[
  {
    "key": 1,
    "month": "January",
    "flowerImage": "https://www.almanac.com/sites/default/files/styles/primary_image_in_article/public/image_nodes/snowdrop.jpg?itok=ozOtfP-K",
    "flower": "Snow Drop",
    "funfacts": "Signifies hope and beauty"
  },
  {
    "key": 2,
    "month": "January",
    "flowerImage": "https://www.almanac.com/sites/default/files/users/AlmanacStaffArchive/carnation-pink_full_width.jpg",
    "flower": "Carnation",
    "funfacts": "According to Christian lore, pink carnations sprouted from the tears of the Virgin Mary as she wept for Jesus. Therefore, a pink carnation often symbolizes a mother’s unyielding love."
  },
  {
    "key": 3,
    "month": "February",
    "flowerImage": "https://www.almanac.com/sites/default/files/styles/primary_image_in_article/public/image_nodes/primroses-purple.jpg?itok=Dq0Ph4me",
    "flower": "Violet",
    "funfacts": "Violets signify watchfulness, loyalty, and faithfulness. Give a violet to someone to let them know you’ll always be there for them!"
  },
  {
    "key": 4,
    "month": "February",
    "flowerImage": "https://www.almanac.com/sites/default/files/users/AlmanacStaffArchive/primrose-pots_0_full_width.jpg",
    "flower": "Primrose",
    "funfacts": "lets someone know you can’t live without them. Primroses lets someone know you can’t live without them. They are colorful perennials of European origin that are not actually related to the rose. Among the first to bloom as winter retreats, they’ll multiply each year if given a little shade and moist (but not soggy) soil. "
  },
  {
    "key": 5,
    "month": "March",
    "flowerImage": "https://www.almanac.com/sites/default/files/users/AlmanacStaffArchive/daffodil-march_birth_flower-1920x1534px-pixabay_0_full_width.jpg",
    "flower": "Daffodil",
    "funfacts": "The daffodil symbolizes unequaled love, so giving this flower to someone expresses a deep love that can not be rivaled or imitated. It has also been associated in history with death and rebirth—from the death of the self-loving Narcissus in Greek mythology to its perennial return as an Easter flower.  "
  },
  {
    "key": 6,
    "month": "April",
    "flowerImage": "https://www.almanac.com/sites/default/files/styles/primary_image_in_article/public/daisy_april_birth_flower_1920x1280px_pixabay.jpg?itok=9ZV1Ibr5",
    "flower": "Daisy",
    "funfacts": "The daisy conveys innocence, loyal love, and purity. Yet, it is also a flower given between friends to keep a secret; the daisy means “I’ll never tell.”"
  },
  {
    "key": 7,
    "month": "April",
    "flowerImage": "https://www.almanac.com/sites/default/files/users/The%20Editors/sweet-pea-px.jpg",
    "flower": "Daisy",
    "funfacts": "While sweet peas signify blissful pleasure, on the other hand they are also used to say good-bye. Flies find the sweet pea’s fragrance offensive and will leave its environs in a hurry."
  },
  {
    "key": 8,
    "month": "May",
    "flowerImage": "https://www.almanac.com/sites/default/files/styles/primary_image_in_article/public/image_nodes/lily-of-the-valley-sun.jpg?itok=aTlmQU6T",
    "flower": "Lily-of-the-Valley",
    "funfacts": "The fragrant lily-of-the-valley signifies sweetness, humility, and a return to happiness. If you want to show your loved one that your life is complete with them, give them a few lilies of the valley."
  },
  {
    "key": 9,
    "month": "May",
    "flowerImage": "https://www.almanac.com/sites/default/files/users/AlmanacStaffArchive/hawthorn_may_birth_flower_1920x1440px_pixabay_full_width.jpg",
    "flower": "Hawthorn",
    "funfacts": "The other May flower is the hawthorn plant, which represents hope and supreme happiness. Hawthorn signifies that you want only the best for the recipient."
  },
  {
    "key": 10,
    "month": "June",
    "flowerImage": "https://www.almanac.com/sites/default/files/styles/primary_image_in_article/public/image_nodes/rose-pink.jpg?itok=R526N90N",
    "flower": "Rose",
    "funfacts": "Symbolically, the rose has more meanings than one can count! A pink rose means perfect happiness, while a red rose means “I love you.”A white rose signifies innocence, purity, and new beginnings. A yellow rose conveys jealousy. A bouquet of roses means sincere gratitude, whereas a single rose amplifies the meaning of the color (a single red rose means “I REALLY love you”)."
  },
  {
    "key": 11,
    "month": "June",
    "flowerImage": "https://www.almanac.com/sites/default/files/users/AlmanacStaffArchive/trumpethoneysuckle.jpg",
    "flower": "Honeysuckle",
    "funfacts": "The other June flower is honeysuckle, which is a strong symbol for the everlasting bonds of love. Honeysuckle flowers are magnets for hummingbirds! There are shrub forms of honeysuckle, which make great hedges, and there are vining forms such as the trumpet honeysuckle."
  },
  {
    "key": 12,
    "month": "July",
    "flowerImage": "https://www.almanac.com/sites/default/files/users/The%20Editors/larkspur-blue_full_width.jpg",
    "flower": "Larkspur",
    "funfacts": "Each color variation of the larkspur has a different meaning; pink means fickleness, white conveys a happy nature, purple normally represents a first love, and blue signifies grace. Generally, larkspur indicates strong bonds of love."
  },
  {
    "key": 13,
    "month": "July",
    "flowerImage": "https://www.almanac.com/sites/default/files/users/AlmanacStaffArchive/water_lily_july_birth_flower_1920x1271px_pixabay_full_width.jpg",
    "flower": "Water Lily",
    "funfacts": "The water lily, which symbolizes purity and majesty. Aside from being lovely in their own right, water lilies are often used in ponds to deter the growth of algae and to shade and cool the water for resident fish and frogs."
  },
  {
    "key": 14,
    "month": "August",
    "flowerImage": "https://www.almanac.com/sites/default/files/styles/primary_image_in_article/public/image_nodes/gladiolus-updated-1920x1280px_pixabay.jpg?itok=8Sa7guxg",
    "flower": "Gladiolus",
    "funfacts": "The gladiolus, or ‘sword lily,’ represents remembrance, calm, integrity, and infatuation. Gladiolus indicates that the heart is being “pierced with love.”"
  },
  {
    "key": 15,
    "month": "August",
    "flowerImage": "https://www.almanac.com/sites/default/files/users/AlmanacStaffArchive/poppy_july_birth_flower_1920x1247px_pixabay_full_width.jpg",
    "flower": "Poppy",
    "funfacts": "A red poppy signifies pleasure, a white poppy is given for consolation; and a yellow poppy wishes wealth and success."
  },
  {
    "key": 16,
    "month": "September",
    "flowerImage": "https://www.almanac.com/sites/default/files/styles/primary_image_in_article/public/image_nodes/asters-updated-1920x1275.jpg?itok=grmqv-KK",
    "flower": "Aster",
    "funfacts": "Asters are mainly symbols of powerful love. Perhaps because of their positive symbolism, according to folklore they were once burned to ward off serpents. Asters add a punch of color to the late summer and early fall landscape and require minimal care."
  },
  {
    "key": 17,
    "month": "September",
    "flowerImage": "https://www.almanac.com/sites/default/files/users/AlmanacStaffArchive/morning_glory_september_birth_flower_1280x960_pixabay_full_width.jpg",
    "flower": "Morning Glory",
    "funfacts": "Morning glories are simple symbols of affection. Those who rise early may be able to watch their lovely blooms open. Morning glory flowers generally curl closed later in the day, hence their name!"
  },
  {
    "key": 18,
    "month": "October",
    "flowerImage": "https://www.almanac.com/sites/default/files/styles/primary_image_in_article/public/image_nodes/flower-2469091_1920.jpg?itok=ot3b_RSd",
    "flower": "Marigold",
    "funfacts": "Marigolds traditionally symbolized despair and grief over a loved one. It may be surprising that such a cheerful flower is associated with the dead. However, for many cultures, it's those neon-bright orange and yellow hues that represent the sunrays or light paths that guide their dearly departed. The bright orange and yellow hues also represent the beauty and warmth of the rising Sun, and its power to resurrect.Today, we often focus more on sunny colors of the marigold, representing optimism and prosperity."
  },
  {
    "key": 19,
    "month": "October",
    "flowerImage": "https://www.almanac.com/sites/default/files/users/AlmanacStaffArchive/cosmos-2754599_1920_full_width.jpg",
    "flower": "Cosmos",
    "funfacts": "The name Cosmos comes from the Greek kosmos, meaning order, harmony, or the world. Spanish mission priests in Mexico cultivated cosmos in the mission gardens, and gave it this name because of its “evenly placed petals.” Not only is order and harmony expressed in the blossom’s symmetry, grace, and simplicity, but also in the symmetrically balanced, regularly-doubled production of leaf and blossom stems."
  },
  {
    "key": 20,
    "month": "November",
    "flowerImage": "https://www.almanac.com/sites/default/files/users/The%20Editors/chrysanthemum-pink_full_width.jpg",
    "flower": "Chrysanthemum aka Mums",
    "funfacts": "A native to Asia with a history that dates back to 15th century B.C., chrysanthemum symbolism often originates from its original birthplace. In Japan, there’s even a “Festival of Happiness” to celebrate this flower each year. Both the Chinese and Japanese consider chrysanthemums a powerful emblem of youth. The Chinese also believe that it prevents gray hair. A symbol of the sun, the Japanese consider the orderly unfolding of the chrysanthemum’s petals to represent perfection. Confucius once suggested chrysanthemums be used as an object of meditation. It’s said that a single petal placed in the bottom of a glass of wine enhances longevity."
  },
  {
    "key": 21,
    "month": "December",
    "flowerImage": "https://www.almanac.com/sites/default/files/users/AlmanacStaffArchive/paperwhite_narcissus_december_birth_flower_2048x1536_credit_needed_wikimedia_full_width.jpg",
    "flower": "Narcissus",
    "funfacts": "Narcissus conveys that you want your beloved to stay just the way they are. While there are many types of flowers in the genus Narcissus (including the daffodil), the paperwhite is the winter-growing variety and the birth flower for December."
  },
  {
    "key": 21,
    "month": "December",
    "flowerImage": "https://www.almanac.com/sites/default/files/styles/primary_image_in_article/public/image_nodes/holly-leaves.jpg?itok=XDtKoUcD",
    "flower": "Holly",
    "funfacts": "Holly symbolizes a wish for domestic happiness. Although some animals and birds enjoy holly berries, they are semi-toxic to humans. The good news is that deer tend to avoid eating holly, which makes them a deer-resistant plant for gardens."
  }
]
